SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_rfsense.h
/* Bit fields for RFSENSE TRIMPTAT */
#define _RFSENSE_TRIMPTAT_RESETVALUE             0x00000420UL                              /**< Default value for RFSENSE_TRIMPTAT          */
#define _RFSENSE_TRIMPTAT_MASK                   0x0000073FUL                              /**< Mask for RFSENSE_TRIMPTAT                   */
#define _RFSENSE_TRIMPTAT_TRIMRES_SHIFT          0                                         /**< Shift value for RFSENSE_TRIMRES             */
#define _RFSENSE_TRIMPTAT_TRIMRES_MASK           0x3FUL                                    /**< Bit mask for RFSENSE_TRIMRES                */
#define _RFSENSE_TRIMPTAT_TRIMRES_DEFAULT        0x00000020UL                              /**< Mode DEFAULT for RFSENSE_TRIMPTAT           */
#define RFSENSE_TRIMPTAT_TRIMRES_DEFAULT         (_RFSENSE_TRIMPTAT_TRIMRES_DEFAULT << 0)  /**< Shifted mode DEFAULT for RFSENSE_TRIMPTAT   */
#define _RFSENSE_TRIMPTAT_TRIMCURR_SHIFT         8                                         /**< Shift value for RFSENSE_TRIMCURR            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_MASK          0x700UL                                   /**< Bit mask for RFSENSE_TRIMCURR               */
#define _RFSENSE_TRIMPTAT_TRIMCURR_DEFAULT       0x00000004UL                              /**< Mode DEFAULT for RFSENSE_TRIMPTAT           */
#define _RFSENSE_TRIMPTAT_TRIMCURR_m80pct        0x00000000UL                              /**< Mode m80pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_m60pct        0x00000001UL                              /**< Mode m60pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_m40pct        0x00000002UL                              /**< Mode m40pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_m20pct        0x00000003UL                              /**< Mode m20pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_default       0x00000004UL                              /**< Mode default for RFSENSE_TRIMPTAT           */
#define _RFSENSE_TRIMPTAT_TRIMCURR_p20pct        0x00000005UL                              /**< Mode p20pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_p40pct        0x00000006UL                              /**< Mode p40pct for RFSENSE_TRIMPTAT            */
#define _RFSENSE_TRIMPTAT_TRIMCURR_p60pct        0x00000007UL                              /**< Mode p60pct for RFSENSE_TRIMPTAT            */
#define RFSENSE_TRIMPTAT_TRIMCURR_DEFAULT        (_RFSENSE_TRIMPTAT_TRIMCURR_DEFAULT << 8) /**< Shifted mode DEFAULT for RFSENSE_TRIMPTAT   */
#define RFSENSE_TRIMPTAT_TRIMCURR_m80pct         (_RFSENSE_TRIMPTAT_TRIMCURR_m80pct << 8)  /**< Shifted mode m80pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_m60pct         (_RFSENSE_TRIMPTAT_TRIMCURR_m60pct << 8)  /**< Shifted mode m60pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_m40pct         (_RFSENSE_TRIMPTAT_TRIMCURR_m40pct << 8)  /**< Shifted mode m40pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_m20pct         (_RFSENSE_TRIMPTAT_TRIMCURR_m20pct << 8)  /**< Shifted mode m20pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_default        (_RFSENSE_TRIMPTAT_TRIMCURR_default << 8) /**< Shifted mode default for RFSENSE_TRIMPTAT   */
#define RFSENSE_TRIMPTAT_TRIMCURR_p20pct         (_RFSENSE_TRIMPTAT_TRIMCURR_p20pct << 8)  /**< Shifted mode p20pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_p40pct         (_RFSENSE_TRIMPTAT_TRIMCURR_p40pct << 8)  /**< Shifted mode p40pct for RFSENSE_TRIMPTAT    */
#define RFSENSE_TRIMPTAT_TRIMCURR_p60pct         (_RFSENSE_TRIMPTAT_TRIMCURR_p60pct << 8)  /**< Shifted mode p60pct for RFSENSE_TRIMPTAT    */

/* Bit fields for RFSENSE TRIMBG */
#define _RFSENSE_TRIMBG_RESETVALUE               0x00000088UL                           /**< Default value for RFSENSE_TRIMBG            */
#define _RFSENSE_TRIMBG_MASK                     0x000000FFUL                           /**< Mask for RFSENSE_TRIMBG                     */
#define _RFSENSE_TRIMBG_TRIMREF_SHIFT            0                                      /**< Shift value for RFSENSE_TRIMREF             */
#define _RFSENSE_TRIMBG_TRIMREF_MASK             0xFUL                                  /**< Bit mask for RFSENSE_TRIMREF                */
#define _RFSENSE_TRIMBG_TRIMREF_DEFAULT          0x00000008UL                           /**< Mode DEFAULT for RFSENSE_TRIMBG             */
#define RFSENSE_TRIMBG_TRIMREF_DEFAULT           (_RFSENSE_TRIMBG_TRIMREF_DEFAULT << 0) /**< Shifted mode DEFAULT for RFSENSE_TRIMBG     */
#define _RFSENSE_TRIMBG_TRIMTC_SHIFT             4                                      /**< Shift value for RFSENSE_TRIMTC              */
#define _RFSENSE_TRIMBG_TRIMTC_MASK              0xF0UL                                 /**< Bit mask for RFSENSE_TRIMTC                 */
#define _RFSENSE_TRIMBG_TRIMTC_DEFAULT           0x00000008UL                           /**< Mode DEFAULT for RFSENSE_TRIMBG             */
#define RFSENSE_TRIMBG_TRIMTC_DEFAULT            (_RFSENSE_TRIMBG_TRIMTC_DEFAULT << 4)  /**< Shifted mode DEFAULT for RFSENSE_TRIMBG     */

/* Bit fields for RFSENSE TRIMDAC */
#define _RFSENSE_TRIMDAC_RESETVALUE              0x00007F7FUL                             /**< Default value for RFSENSE_TRIMDAC           */
#define _RFSENSE_TRIMDAC_MASK                    0x03FFFFFFUL                             /**< Mask for RFSENSE_TRIMDAC                    */
#define _RFSENSE_TRIMDAC_TRIMCM_SHIFT            0                                        /**< Shift value for RFSENSE_TRIMCM              */
#define _RFSENSE_TRIMDAC_TRIMCM_MASK             0xFFUL                                   /**< Bit mask for RFSENSE_TRIMCM                 */
#define _RFSENSE_TRIMDAC_TRIMCM_DEFAULT          0x0000007FUL                             /**< Mode DEFAULT for RFSENSE_TRIMDAC            */
#define RFSENSE_TRIMDAC_TRIMCM_DEFAULT           (_RFSENSE_TRIMDAC_TRIMCM_DEFAULT << 0)   /**< Shifted mode DEFAULT for RFSENSE_TRIMDAC    */
#define _RFSENSE_TRIMDAC_CMPOSCAL_SHIFT          8                                        /**< Shift value for RFSENSE_CMPOSCAL            */
#define _RFSENSE_TRIMDAC_CMPOSCAL_MASK           0xFF00UL                                 /**< Bit mask for RFSENSE_CMPOSCAL               */
#define _RFSENSE_TRIMDAC_CMPOSCAL_DEFAULT        0x0000007FUL                             /**< Mode DEFAULT for RFSENSE_TRIMDAC            */
#define RFSENSE_TRIMDAC_CMPOSCAL_DEFAULT         (_RFSENSE_TRIMDAC_CMPOSCAL_DEFAULT << 8) /**< Shifted mode DEFAULT for RFSENSE_TRIMDAC    */
#define _RFSENSE_TRIMDAC_TRIMDM_SHIFT            16                                       /**< Shift value for RFSENSE_TRIMDM              */
#define _RFSENSE_TRIMDAC_TRIMDM_MASK             0x1FF0000UL                              /**< Bit mask for RFSENSE_TRIMDM                 */
#define _RFSENSE_TRIMDAC_TRIMDM_DEFAULT          0x00000000UL                             /**< Mode DEFAULT for RFSENSE_TRIMDAC            */
#define RFSENSE_TRIMDAC_TRIMDM_DEFAULT           (_RFSENSE_TRIMDAC_TRIMDM_DEFAULT << 16)  /**< Shifted mode DEFAULT for RFSENSE_TRIMDAC    */
#define RFSENSE_TRIMDAC_INVDM                    (0x1UL << 25)                            /**< Invert Differential offset polarity         */
#define _RFSENSE_TRIMDAC_INVDM_SHIFT             25                                       /**< Shift value for RFSENSE_INVDM               */
#define _RFSENSE_TRIMDAC_INVDM_MASK              0x2000000UL                              /**< Bit mask for RFSENSE_INVDM                  */
#define _RFSENSE_TRIMDAC_INVDM_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for RFSENSE_TRIMDAC            */
#define RFSENSE_TRIMDAC_INVDM_DEFAULT            (_RFSENSE_TRIMDAC_INVDM_DEFAULT << 25)   /**< Shifted mode DEFAULT for RFSENSE_TRIMDAC    */

/* Bit fields for RFSENSE SPARE */
#define _RFSENSE_SPARE_RESETVALUE                0x00000000UL                           /**< Default value for RFSENSE_SPARE             */
#define _RFSENSE_SPARE_MASK                      0x000000F1UL                           /**< Mask for RFSENSE_SPARE                      */
#define RFSENSE_SPARE_SPARE                      (0x1UL << 0)                           /**< Spare register                              */
#define _RFSENSE_SPARE_SPARE_SHIFT               0                                      /**< Shift value for RFSENSE_SPARE               */
#define _RFSENSE_SPARE_SPARE_MASK                0x1UL                                  /**< Bit mask for RFSENSE_SPARE                  */
#define _RFSENSE_SPARE_SPARE_DEFAULT             0x00000000UL                           /**< Mode DEFAULT for RFSENSE_SPARE              */
#define RFSENSE_SPARE_SPARE_DEFAULT              (_RFSENSE_SPARE_SPARE_DEFAULT << 0)    /**< Shifted mode DEFAULT for RFSENSE_SPARE      */
#define _RFSENSE_SPARE_DIGSPARE_SHIFT            4                                      /**< Shift value for RFSENSE_DIGSPARE            */
#define _RFSENSE_SPARE_DIGSPARE_MASK             0xF0UL                                 /**< Bit mask for RFSENSE_DIGSPARE               */
#define _RFSENSE_SPARE_DIGSPARE_DEFAULT          0x00000000UL                           /**< Mode DEFAULT for RFSENSE_SPARE              */
#define RFSENSE_SPARE_DIGSPARE_DEFAULT           (_RFSENSE_SPARE_DIGSPARE_DEFAULT << 4) /**< Shifted mode DEFAULT for RFSENSE_SPARE      */

/* Bit fields for RFSENSE SWCTRL */
#define _RFSENSE_SWCTRL_RESETVALUE               0x00000010UL                             /**< Default value for RFSENSE_SWCTRL            */
#define _RFSENSE_SWCTRL_MASK                     0x0000001FUL                             /**< Mask for RFSENSE_SWCTRL                     */
#define _RFSENSE_SWCTRL_SWCTRL_SHIFT             0                                        /**< Shift value for RFSENSE_SWCTRL              */
#define _RFSENSE_SWCTRL_SWCTRL_MASK              0xFUL                                    /**< Bit mask for RFSENSE_SWCTRL                 */
#define _RFSENSE_SWCTRL_SWCTRL_DEFAULT           0x00000000UL                             /**< Mode DEFAULT for RFSENSE_SWCTRL             */
#define RFSENSE_SWCTRL_SWCTRL_DEFAULT            (_RFSENSE_SWCTRL_SWCTRL_DEFAULT << 0)    /**< Shifted mode DEFAULT for RFSENSE_SWCTRL     */
#define RFSENSE_SWCTRL_ANACLKINV                 (0x1UL << 4)                             /**< Invert Analog clock                         */
#define _RFSENSE_SWCTRL_ANACLKINV_SHIFT          4                                        /**< Shift value for RFSENSE_ANACLKINV           */
#define _RFSENSE_SWCTRL_ANACLKINV_MASK           0x10UL                                   /**< Bit mask for RFSENSE_ANACLKINV              */
#define _RFSENSE_SWCTRL_ANACLKINV_DEFAULT        0x00000001UL                             /**< Mode DEFAULT for RFSENSE_SWCTRL             */
#define RFSENSE_SWCTRL_ANACLKINV_DEFAULT         (_RFSENSE_SWCTRL_ANACLKINV_DEFAULT << 4) /**< Shifted mode DEFAULT for RFSENSE_SWCTRL     */

/* Bit fields for RFSENSE DIAGCTRL */
#define _RFSENSE_DIAGCTRL_RESETVALUE             0x00000000UL                                 /**< Default value for RFSENSE_DIAGCTRL          */
#define _RFSENSE_DIAGCTRL_MASK                   0x00000003UL                                 /**< Mask for RFSENSE_DIAGCTRL                   */
#define RFSENSE_DIAGCTRL_DIAGABYPN               (0x1UL << 0)                                 /**< Diag buffer bypass                          */
#define _RFSENSE_DIAGCTRL_DIAGABYPN_SHIFT        0                                            /**< Shift value for RFSENSE_DIAGABYPN           */
#define _RFSENSE_DIAGCTRL_DIAGABYPN_MASK         0x1UL                                        /**< Bit mask for RFSENSE_DIAGABYPN              */
#define _RFSENSE_DIAGCTRL_DIAGABYPN_DEFAULT      0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_DIAGCTRL           */
#define _RFSENSE_DIAGCTRL_DIAGABYPN_ENBYPASS     0x00000000UL                                 /**< Mode ENBYPASS for RFSENSE_DIAGCTRL          */
#define _RFSENSE_DIAGCTRL_DIAGABYPN_DISBYPASS    0x00000001UL                                 /**< Mode DISBYPASS for RFSENSE_DIAGCTRL         */
#define RFSENSE_DIAGCTRL_DIAGABYPN_DEFAULT       (_RFSENSE_DIAGCTRL_DIAGABYPN_DEFAULT << 0)   /**< Shifted mode DEFAULT for RFSENSE_DIAGCTRL   */
#define RFSENSE_DIAGCTRL_DIAGABYPN_ENBYPASS      (_RFSENSE_DIAGCTRL_DIAGABYPN_ENBYPASS << 0)  /**< Shifted mode ENBYPASS for RFSENSE_DIAGCTRL  */
#define RFSENSE_DIAGCTRL_DIAGABYPN_DISBYPASS     (_RFSENSE_DIAGCTRL_DIAGABYPN_DISBYPASS << 0) /**< Shifted mode DISBYPASS for RFSENSE_DIAGCTRL */
#define RFSENSE_DIAGCTRL_DIAGACHP                (0x1UL << 1)                                 /**< Diag buffer chop                            */
#define _RFSENSE_DIAGCTRL_DIAGACHP_SHIFT         1                                            /**< Shift value for RFSENSE_DIAGACHP            */
#define _RFSENSE_DIAGCTRL_DIAGACHP_MASK          0x2UL                                        /**< Bit mask for RFSENSE_DIAGACHP               */
#define _RFSENSE_DIAGCTRL_DIAGACHP_DEFAULT       0x00000000UL                                 /**< Mode DEFAULT for RFSENSE_DIAGCTRL           */
#define _RFSENSE_DIAGCTRL_DIAGACHP_DISABLE       0x00000000UL                                 /**< Mode DISABLE for RFSENSE_DIAGCTRL           */
#define _RFSENSE_DIAGCTRL_DIAGACHP_ENABLE        0x00000001UL                                 /**< Mode ENABLE for RFSENSE_DIAGCTRL            */
#define RFSENSE_DIAGCTRL_DIAGACHP_DEFAULT        (_RFSENSE_DIAGCTRL_DIAGACHP_DEFAULT << 1)    /**< Shifted mode DEFAULT for RFSENSE_DIAGCTRL   */
#define RFSENSE_DIAGCTRL_DIAGACHP_DISABLE        (_RFSENSE_DIAGCTRL_DIAGACHP_DISABLE << 1)    /**< Shifted mode DISABLE for RFSENSE_DIAGCTRL   */
#define RFSENSE_DIAGCTRL_DIAGACHP_ENABLE         (_RFSENSE_DIAGCTRL_DIAGACHP_ENABLE << 1)     /**< Shifted mode ENABLE for RFSENSE_DIAGCTRL    */

